UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПАК_МаршрутныйЛист/ПАК_МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПАК_МаршрутныйЛист</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.СлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтгрузки</name>
    <type>
      <types>EnumRef.СпособыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВесЛома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВывозов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТочек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПеремещенийБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
        <types>String</types>
        <types>CatalogRef.Контрагенты</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаявкаНаЛом</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходнаяНакладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>EnumRef.ТипыОперацийМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесЛома</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/AccumulationRegisters/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b9fd907f-6f64-47cc-9a66-8c235d72a73c">
  <name>ЗаказыПокупателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b7b24c9e-733b-4e9f-97c6-d6514ca7722e">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="55fd3254-bb99-45bd-b284-6e1b335006fe">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1e7986a0-d9d4-4c53-a2f1-d1e4e1da3100">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0c5581c8-ea05-44a0-9148-7270b2d19b9b">
    <name>Курьер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="804c6f0e-73b4-426a-afa3-33429bbe9bda">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="74a37dbc-9e48-4646-b16b-8a55bec6c5a5">
    <name>ПунктВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="475d140a-d057-46e5-8761-80338928c423">
    <name>Почта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособыОтгрузки/СпособыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="22114129-0ca8-4ac2-a3ee-8faefd0dce6a">
  <name>СпособыОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="ed1145f1-d002-4e1d-8ce5-fe26e2adcf06">
    <name>ПередатьКурьеруСлужбыДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83355dd2-0782-4392-834c-3276bd558295">
    <name>ПередатьКурьеруЕдиногоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="06a7fa3a-d47c-40ec-82f8-17abc0d9c02c">
    <name>СамостоятельноПривезтиНаЕдиныйСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="867d4d33-9658-491f-ac48-9ba9df64380b">
    <name>СамостоятельноПривезтиНаСкладСлужбыДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СостояниеМаршрута/СостояниеМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеМаршрута</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПереданВКлиентскийСервис</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>СозданыДокументы</name>
  </enumValues>
  <enumValues>
    <name>СобранДокументыРаспечатаны</name>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e557f2c9-6893-4523-9b13-07e678b2778a">
  <name>РасходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6dc7780f-7e2c-400d-a18b-888d94303ef2">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2a715dc-bcd2-491e-872d-d5422c4eaf75">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe6b9938-86b2-45ed-95b8-cc7399950548">
    <name>НомерСчетаНаОплату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="92e239c7-d87f-4f90-be92-f0e01ce9340a">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fbc2a72-eea7-43e5-bc02-cb7b92a7a8de">
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e1ced8-1604-4e0f-bf43-72ad120ee9fd">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a823c75-83b9-4fec-a560-109ffb526f51">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e89bf721-aa4c-49a8-aebb-7df31c82609e">
    <name>ПоложениеЗаказаПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e362a3ee-cbd4-427e-ba1c-135d2ac64280">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="9e14912c-3e72-43a6-bcf4-596972af9386">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ee926eaf-dc5a-412f-a8a8-70f96c93db4b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="843462ec-1304-440c-adf1-20e04d768d76">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07997f2a-265a-4e2e-8e3c-73bc062af70f">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a19d270-211a-4ffd-aa88-992e3cc0a1d2">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПАК_МаршрутныйЛист/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		Если НЕ ЗначениеЗаполнено(СлужбаДоставки) И НЕ ЗначениеЗаполнено(Курьер)  Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ЭтоДоставкаСобственнымиСилами() Тогда
			ИсключитьРеквизитИзПроверки("СпособОтгрузки", ПроверяемыеРеквизиты);
			ИсключитьРеквизитИзПроверки("Склад", ПроверяемыеРеквизиты);
			ИсключитьРеквизитИзПроверки("АдресОтправки", ПроверяемыеРеквизиты);
		ИначеЕсли ЭтоЗаборКурьеромСлужбыДоставки() Тогда 
			ИсключитьРеквизитИзПроверки("Курьер", ПроверяемыеРеквизиты);
		ИначеЕсли ЭтоСамопривозНаСкладСлужбыДоставки() Тогда 
			ИсключитьРеквизитИзПроверки("Склад", ПроверяемыеРеквизиты);
			ИсключитьРеквизитИзПроверки("АдресОтправки", ПроверяемыеРеквизиты);
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если Заказы.Количество()=0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Укажите отгружаемые заказы'"),
			Ссылка,
			"Заказы",,
			Отказ);
		КонецЕсли; 
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		ОбновитьДанныеЗаказов(Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ОбработкаУдаленияПроведения(Отказ)
		
		ОбновитьДанныеЗаказов(Отказ, Ложь);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если СпособДоставки = Перечисления.СпособыДоставки.Курьер И ЗначениеЗаполнено(ЭтотОбъект.ВодительПосторонний) Тогда
			     ЭтотОбъект.ВодительПосторонний = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;	
		
		Если НЕ СпособДоставки = Перечисления.СпособыДоставки.Курьер И ЗначениеЗаполнено(ЭтотОбъект.Курьер) Тогда
			     ЭтотОбъект.Курьер = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;
		
		Если  НЕ ЗначениеЗаполнено(ЭтотОбъект.ФИОВодителя) Тогда
			
			Если СпособДоставки = Перечисления.СпособыДоставки.Курьер Тогда
				Если  ЗначениеЗаполнено(ЭтотОбъект.Курьер)   Тогда
					ЭтотОбъект.ФИОВодителя = ЭтотОбъект.Курьер.Наименование; 
				КонецЕсли; 
			Иначе
				Если  ЗначениеЗаполнено(ЭтотОбъект.ВодительПосторонний)   Тогда
					ЭтотОбъект.ФИОВодителя = ЭтотОбъект.ВодительПосторонний.Наименование; 
				КонецЕсли; 
			КонецЕсли; 
			
		КонецЕсли;		
		
		СуммаБезНДС   		=	0;
		ОбщийВес        		=	0;
		ОбщийВесЛома   		=	0;
		КоличествоВывозов 	=	0;
		КоличествоТочек		=	0;
		СуммаПеремещенийБезНДС =0;
		
		Для каждого СтрЗаказы Из  Заказы Цикл
			
			
			
			Если ТипЗнч(СтрЗаказы.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя")  Тогда
				СтрЗаказы.Вес  =  СтрЗаказы.Заказ.Вес;
				Если  ПустаяСтрока(СтрЗаказы.Примечание) Тогда
					СтрЗаказы.Примечание = СокрЛП(СтрЗаказы.Заказ.Комментарий) +" " + СокрЛП(СтрЗаказы.Заказ.ДополнительнаяИнформацияПоДоставке);
				КонецЕсли;
				
				КоличествоТочек		=	КоличествоТочек		+	1;	
				ОбщийВес 				=	ОбщийВес				+  СтрЗаказы.Заказ.Вес;
				СуммаБезНДС   		= 	СуммаБезНДС   		+  СтрЗаказы.Заказ.саУНФ_Сумма;
				СтрЗаказы.Сумма   =   СтрЗаказы.Заказ.саУНФ_Сумма;
			ИначеЕсли ТипЗнч(СтрЗаказы.Заказ) = Тип("ДокументСсылка.ЗаявкаНаЛом")  Тогда
                СтрЗаказы.ВесЛома  =  СтрЗаказы.Заказ.Вес;
				Если  ПустаяСтрока(СтрЗаказы.Примечание) Тогда
					СтрЗаказы.Примечание = СокрЛП(СтрЗаказы.Заказ.Комментарий);
				КонецЕсли;
				СтрЗаказы.Сумма   =	0;
				КоличествоВывозов 		=	КоличествоВывозов 	+	1;
				ОбщийВесЛома   			=	ОбщийВесЛома   		+ 	СтрЗаказы.Заказ.Вес;
			ИначеЕсли ТипЗнч(СтрЗаказы.Заказ) = Тип("ДокументСсылка.ПеремещениеЗапасов")  Тогда
	              СтрЗаказы.Вес  =  СтрЗаказы.Заказ.Вес;
				  Если  ПустаяСтрока(СтрЗаказы.Примечание) Тогда
					СтрЗаказы.Примечание = СокрЛП(СтрЗаказы.Заказ.Комментарий);
				КонецЕсли;
				КоличествоТочек		=	КоличествоТочек		+	1;	
				ОбщийВес 			=	ОбщийВес				+  СтрЗаказы.Заказ.Вес;
				СтрЗаказы.Сумма   	=	0;			СтрЗаказы.Сумма   =	0;
				Если ТипЗнч(СтрЗаказы.Заказ.ЗаказСнабжения)=Тип("ДокументСсылка.саУНФ_ЗаказСнабжения")  Тогда
					СтрЗаказы.Сумма   = СтрЗаказы.Заказ.ЗаказСнабжения.Запасы.Итог("Сумма"); 
					СуммаПеремещенийБезНДС = СуммаПеремещенийБезНДС+СтрЗаказы.Сумма;
				КонецЕсли;
             ИначеЕсли СтрЗаказы.Заказ = Неопределено Тогда
				 ОбщийВес 			=	ОбщийВес				+  СтрЗаказы.Вес;
				 ОбщийВесЛома   	=	ОбщийВесЛома   		+ 	СтрЗаказы.ВесЛома;
				 СуммаБезНДС   		= 	СуммаБезНДС   		+  СтрЗаказы.Сумма;
				 
				 КоличествоТочек		=	КоличествоТочек		+	1;
				 Если СтрЗаказы.ВесЛома>0 Тогда
				 КоличествоВывозов 		=	КоличествоВывозов 	+	1;
				 КонецЕсли;						
			КонецЕсли;
			
		КонецЦикла; 
	КонецПроцедуры
	
	Процедура ПриЗаписи(Отказ)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Истина);
		Для каждого СтрокаТабличнойЧасти Из ЭтотОбъект.Заказы Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Заказ) Тогда
				Продолжить;                                                                                                                      
			КонецЕсли; 
			ТекущийЗаказ =  СтрокаТабличнойЧасти.Заказ;
			  Записывать=Ложь;
			  Если ТипЗнч(СтрокаТабличнойЧасти.Заказ) = Тип("ДокументСсылка.ПеремещениеЗапасов")  Тогда
				  Если   НЕ ТекущийЗаказ.Водитель =  ЭтотОбъект.Курьер Тогда
					  Записывать=Истина;
				  КонецЕсли;   
			  Иначе
				  Если НЕ ТекущийЗаказ.Курьер    =  ЭтотОбъект.Курьер Тогда
					  Записывать=Истина;
				  КонецЕсли; 			
			  КонецЕсли;

			
			Если   ЭтоНовый() ИЛИ ТекущийЗаказ.ПАК_МаршрутныйЛист<>ЭтотОбъект.Ссылка ИЛИ ТекущийЗаказ.ФИОВодителя <> ЭтотОбъект.ФИОВодителя 
			ИЛИ Записывать	
				Тогда
				ЗаказОбъект = СтрокаТабличнойЧасти.Заказ.ПолучитьОбъект();
				ЗаказОбъект.ПАК_МаршрутныйЛист 	= 	ЭтотОбъект.Ссылка;
				ЗаказОбъект.ЗонаТариф  						= 	ЭтотОбъект.ЗонаТариф;
				ЗаказОбъект.ТелефонКурьера          		=  ЭтотОбъект.ТелефонКурьера;
				ЗаказОбъект.ДатаЗагрузкиАвтомобиля 	= 	ЭтотОбъект.ДатаЗагрузки;
				ЗаказОбъект.Автомобиль						=	ЭтотОбъект.Автомобиль; 
				ЗаказОбъект.ФИОВодителя                  =  ЭтотОбъект.ФИОВодителя;
				
				Если ТипЗнч(СтрокаТабличнойЧасти.Заказ) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
				        ЗаказОбъект.Водитель                     	=  ЭтотОбъект.Курьер;
					Иначе
				      ЗаказОбъект.Курьер                        	=  ЭтотОбъект.Курьер;
				КонецЕсли;
				      ЗаказОбъект.ВодительПосторонний    =	 ЭтотОбъект.ВодительПосторонний;
				ЗаказОбъект.Записать();
			                                                                                                 
		Иначе	
			  Если СтрокаТабличнойЧасти.Заказ.ДатаЗагрузкиАвтомобиля<>ЭтотОбъект.ДатаЗагрузки  Тогда
			          ЗаказОбъект = СтрокаТабличнойЧасти.Заказ.ПолучитьОбъект();
					  ЗаказОбъект.ДатаЗагрузкиАвтомобиля 	= 	ЭтотОбъект.ДатаЗагрузки;
					  ЗаказОбъект.Записать();
			  КонецЕсли; 
		КонецЕсли; 	
			
		КонецЦикла;
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		
				
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Функция ЭтоДоставкаСобственнымиСилами()
		
		Возврат СлужбаДоставки = Справочники.СлужбыДоставки.ДоставкаСобственнымиСилами;
		
	КонецФункции
	
	Функция ЭтоЗаборКурьеромСлужбыДоставки()
		
		Возврат СпособОтгрузки = Перечисления.СпособыОтгрузки.ПередатьКурьеруЕдиногоСклада
		Или СпособОтгрузки = Перечисления.СпособыОтгрузки.ПередатьКурьеруСлужбыДоставки;
		
	КонецФункции
	
	Функция ЭтоСамопривозНаСкладСлужбыДоставки()
		
		Возврат СпособОтгрузки = Перечисления.СпособыОтгрузки.СамостоятельноПривезтиНаЕдиныйСклад
		Или СпособОтгрузки = Перечисления.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки;
		
	КонецФункции
	
	Процедура ОбновитьДанныеЗаказов(Отказ, Проведение = Истина)
		
		//Если Отказ Тогда
			Возврат;
		//КонецЕсли;
		
		ОбсужденияЗаказов = Неопределено;
		ДополнительныеСвойства.Свойство("ОбсужденияЗаказов", ОбсужденияЗаказов);
		Если ТипЗнч(ОбсужденияЗаказов)<>Тип("Соответствие") Тогда
			ОбсужденияЗаказов = Новый Соответствие;
		КонецЕсли; 
		
		НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаЗаказов", Заказы.Выгрузить());
		Запрос.УстановитьПараметр("СлужбаДоставки", СлужбаДоставки);
		Запрос.УстановитьПараметр("Курьер", Курьер);
		Запрос.УстановитьПараметр("Проведен", Проведение);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаЗаказов.Заказ КАК Документ.ЗаказПокупателя) КАК Заказ,
		|	ВЫРАЗИТЬ(ТаблицаЗаказов.РасходнаяНакладная КАК Документ.РасходнаяНакладная) КАК РасходнаяНакладная,
		|	ТаблицаЗаказов.Доставлен КАК Доставлен
		|ПОМЕСТИТЬ ТаблицаЗаказов
		|ИЗ
		|	&ТаблицаЗаказов КАК ТаблицаЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаказов.Заказ КАК Заказ,
		|	ЗаказПокупателя.ВидЗаказа КАК ВидЗаказа,
		|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаказПокупателя.СлужбаДоставки КАК СлужбаДоставки,
		|	ЗаказПокупателя.Курьер КАК Курьер,
		|	МАКСИМУМ(ТаблицаЗаказов.Доставлен) КАК Доставлен
		|ПОМЕСТИТЬ ЗаказыСвернуто
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ТаблицаЗаказов.Заказ = ЗаказПокупателя.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗаказов.Заказ,
		|	ЗаказПокупателя.ВидЗаказа,
		|	ЗаказПокупателя.СостояниеЗаказа,
		|	ЗаказПокупателя.СлужбаДоставки,
		|	ЗаказПокупателя.Курьер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыСвернуто.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА &Проведен
		|				И ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) = 0
		|				И ЗаказыСвернуто.Доставлен
		|			ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеДоставлен
		|		КОГДА &Проведен
		|				И ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) = 0
		|				И НЕ ЗаказыСвернуто.Доставлен
		|			ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеОтгружен
		|		КОГДА НЕ &Проведен
		|				ИЛИ ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) > 0
		|			ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеОжидаетОтгрузки
		|	КОНЕЦ КАК НовоеСостояние,
		|	ЗаказыСвернуто.СостояниеЗаказа <> ЕСТЬNULL(ВЫБОР
		|			КОГДА &Проведен
		|					И ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) = 0
		|					И ЗаказыСвернуто.Доставлен
		|				ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеДоставлен
		|			КОГДА &Проведен
		|					И ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) = 0
		|					И НЕ ЗаказыСвернуто.Доставлен
		|				ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеОтгружен
		|			КОГДА НЕ &Проведен
		|					ИЛИ ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) > 0
		|				ТОГДА ЗаказыСвернуто.ВидЗаказа.СостояниеОжидаетОтгрузки
		|			ИНАЧЕ ЗаказыСвернуто.СостояниеЗаказа
		|		КОНЕЦ, ЗаказыСвернуто.СостояниеЗаказа) КАК ОбновитьСостояние,
		|	ВЫБОР
		|		КОГДА ЗаказыСвернуто.СлужбаДоставки <> &СлужбаДоставки
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбновитьСлужбуДоставки,
		|	ВЫБОР
		|		КОГДА ЗаказыСвернуто.Курьер <> &Курьер
		|				И &Курьер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбновитьКурьера
		|ПОМЕСТИТЬ Действия
		|ИЗ
		|	ЗаказыСвернуто КАК ЗаказыСвернуто
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
		|				,
		|				ЗаказПокупателя В
		|					(ВЫБРАТЬ
		|						ТаблицаЗаказов.Заказ
		|					ИЗ
		|						ТаблицаЗаказов)) КАК ЗаказыПокупателейОстатки
		|		ПО ЗаказыСвернуто.Заказ = ЗаказыПокупателейОстатки.ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЗаказов.Заказ КАК Заказ,
		|	ТаблицаЗаказов.РасходнаяНакладная КАК РасходнаяНакладная,
		|	МаршрутныйЛистЗаказы.Ссылка КАК МаршрутныйЛист
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|		ПО ТаблицаЗаказов.Заказ = МаршрутныйЛистЗаказы.Заказ
		|			И ТаблицаЗаказов.РасходнаяНакладная = МаршрутныйЛистЗаказы.РасходнаяНакладная
		|			И (МаршрутныйЛистЗаказы.Ссылка <> &Ссылка)
		|			И (МаршрутныйЛистЗаказы.Ссылка.Проведен)
		|ГДЕ
		|	НЕ МаршрутныйЛистЗаказы.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Действия.Заказ КАК Заказ,
		|	Действия.НовоеСостояние КАК НовоеСостояние,
		|	Действия.ОбновитьСостояние КАК ОбновитьСостояние,
		|	Действия.ОбновитьСлужбуДоставки КАК ОбновитьСлужбуДоставки,
		|	Действия.ОбновитьКурьера КАК ОбновитьКурьера
		|ИЗ
		|	Действия КАК Действия
		|ГДЕ
		|	(Действия.ОбновитьСлужбуДоставки
		|			ИЛИ Действия.ОбновитьКурьера
		|			ИЛИ Действия.ОбновитьСостояние)";
		Результат = Запрос.ВыполнитьПакет();
		Ошибки = Результат[3].Выбрать();
		Если НЕ Ошибки.Количество()=0 Тогда
			Пока Ошибки.Следующий() Цикл
				ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = '%1 уже отгружен документом %2'"), Ошибки.Заказ, Ошибки.МаршрутныйЛист),
				Ошибки.МаршрутныйЛист,
				"Заказы", ,
				Отказ);
			КонецЦикла; 
			Возврат;
		КонецЕсли; 
		Выборка = Результат[4].Выбрать();
		ВыведенныеВидыЗаказов = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЗаказОбъект = Выборка.Заказ.ПолучитьОбъект();
			Сообщение = ОбсужденияЗаказов.Получить(Выборка.Заказ);
			// Состояние заказа
			Если Выборка.ОбновитьСостояние Тогда
				Если НЕ ЗначениеЗаполнено(Выборка.НовоеСостояние) Тогда
					// Не настроены состояния заказов
					Если НесколькоВидовЗаказов Тогда
						Если ВыведенныеВидыЗаказов.Найти(ЗаказОбъект.ВидЗаказа)=Неопределено Тогда
							ОбщегоНазначения.СообщитьПользователю(
							СтрШаблон(НСтр("ru = 'Не задано состояние %1 заказа для вида %2'"),
							?(Проведение, НСтр("ru = 'отгрузки'"), НСтр("ru = 'ожидания отгрузки'")),
							ЗаказОбъект.ВидЗаказа),
							ЗаказОбъект.ВидЗаказа,
							?(Проведение, "СостояниеОтгружен", "СостояниеОжидаетОтгрузки"),,
							Отказ);
							ВыведенныеВидыЗаказов.Добавить(ЗаказОбъект.ВидЗаказа);
						КонецЕсли; 
					Иначе
						Если ВыведенныеВидыЗаказов.Найти(Справочники.ВидыЗаказовПокупателей.Основной)=Неопределено Тогда
							ОбщегоНазначения.СообщитьПользователю(
							СтрШаблон(НСтр("ru = 'Не задано состояние %1 заказа'"),
							?(Проведение, НСтр("ru = 'отгрузки'"), НСтр("ru = 'ожидания отгрузки'"))),
							Справочники.ВидыЗаказовПокупателей.Основной,
							?(Проведение, "СостояниеОтгружен", "СостояниеОжидаетОтгрузки"),,
							Отказ);
							ВыведенныеВидыЗаказов.Добавить(Справочники.ВидыЗаказовПокупателей.Основной);
						КонецЕсли; 
					КонецЕсли; 
				Иначе
					Префикс = НСтр("ru = 'Состояние: '");
					ТекстИзменений = ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(ЗаказОбъект.СостояниеЗаказа, Выборка.НовоеСостояние);
					ОбсужденияСервер.ДобавитьОписаниеИзменений(Сообщение, ТекстИзменений, Префикс+": ");
					ЗаказОбъект.СостояниеЗаказа = Выборка.НовоеСостояние;
				КонецЕсли;
			КонецЕсли;
			// Служба доставки
			Если Выборка.ОбновитьСлужбуДоставки Тогда
				Префикс = НСтр("ru = 'Служба доставки: '");
				ТекстИзменений = ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(ЗаказОбъект.СлужбаДоставки, СлужбаДоставки);
				ОбсужденияСервер.ДобавитьОписаниеИзменений(Сообщение, ТекстИзменений, Префикс+": ");
				ЗаказОбъект.СлужбаДоставки = СлужбаДоставки;
			КонецЕсли;
			// Курьер
			Если Выборка.ОбновитьКурьера Тогда
				Префикс = НСтр("ru = 'Курьер: '");
				ТекстИзменений = ОбсужденияСервер.ДобавитьСообщениеОбИзмененииРеквизита(ЗаказОбъект.Курьер, Курьер);
				ОбсужденияСервер.ДобавитьОписаниеИзменений(Сообщение, ТекстИзменений, Префикс+": ");
				ЗаказОбъект.Курьер = Курьер;
			КонецЕсли;
			Если ЗначениеЗаполнено(Сообщение) Тогда
				ОбсужденияСервер.ДобавитьСообщение(
				Сообщение, 
				Выборка.Заказ,
				, 
				Истина);
				ЗаказОбъект.ДополнительныеСвойства.Вставить("ОбсуждениеЗаписано", Истина);
			КонецЕсли; 
			Попытка
				ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Исключение
				Отказ = Истина;
			КонецПопытки; 
		КонецЦикла; 
		
	КонецПроцедуры
	
	Процедура ИсключитьРеквизитИзПроверки(ИмяРеквизита, ПроверяемыеРеквизиты)
		
		Индекс = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
		Если Индекс<>Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс)
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура УстановитьСостояниеЗаказа(Заказ, НовоеСостояние)
		
		ТекстОшибки = НСтр("ru = 'Не удалось изменить состояние заказа заказа %1: %2'", ОбщегоНазначения.КодОсновногоЯзыка());
		Если Заказ.СостояниеЗаказа = НовоеСостояние Тогда
			Возврат;
		КонецЕсли; 
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ЗаказОбъект.СостояниеЗаказа = НовоеСостояние;
		НачатьТранзакцию();
		Попытка
			ЗаказОбъект.Записать();
		Исключение
			ОтменитьТранзакцию();
			Информация = ИнформацияОбОшибке();
			ТекстОшибки = СтрШаблон(ТекстОшибки, ЗаказОбъект.Ссылка, ПодробноеПредставлениеОшибки(Информация));
			ИмяСобытия = НСтр("ru = 'Продажи'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ЗаказОбъект.Метаданные(), ЗаказОбъект.Ссылка, ТекстОшибки);
		КонецПопытки; 
		ЗафиксироватьТранзакцию();
		
	КонецПроцедуры
	
	Функция СостояниеОжидаетОтгрузки(Заказ, Отказ)
		
		НесколькоВидовЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
		Если НесколькоВидовЗаказов Тогда
			ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ВидЗаказа", Истина);
		Иначе
			ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
		КонецЕсли;
		Если ВидЗаказа=Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Нарушение права доступа.'"), Заказ,,,
			Отказ);
			Возврат Неопределено;
		КонецЕсли; 
		СостояниеЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЗаказа, "СостояниеОжидаетОтгрузки", Истина);
		
		Если НЕ ЗначениеЗаполнено(СостояниеЗаказа) Тогда
			Если НесколькоВидовЗаказов Тогда
				ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Не задано состояние готовых к отгрузке заказов для вида %1'"),
				ВидЗаказа),
				ВидЗаказа,
				"СостояниеОжидаетОтгрузки",,
				Отказ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Не задано состояние готовых к отгрузке заказов'"),
				ВидЗаказа,
				"СостояниеОжидаетОтгрузки",,
				Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Возврат СостояниеЗаказа;
		
	КонецФункции

	Процедура ПриКопировании(ОбъектКопирования)
		ЭтотОбъект.Курьер = Справочники.ФизическиеЛица.ПустаяСсылка();
		ЭтотОбъект.ДополнительнаяИнформация ="";
		ЭтотОбъект.Автомобиль  = Справочники.ТранспортныеСредства.ПустаяСсылка();
		ЭтотОбъект.ЗонаТариф    = Справочники.ЗоныТарифыДоставки.ПустаяСсылка();
		ЭтотОбъект.СпособДоставки  = Перечисления.СпособыДоставки.Курьер;
		ЭтотОбъект.СпособОтгрузки = Перечисления.СпособыОтгрузки.ПередатьКурьеруЕдиногоСклада;
		ЭтотОбъект.Склад = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		ЭтотОбъект.АдресОтправки ="";
		ЭтотОбъект.АдресОтправкиЗначенияПолей  ="";
		ЭтотОбъект.Состояние  = Перечисления.СостояниеМаршрута.ВРаботе;
		ЭтотОбъект.ДатаЗагрузки   = Дата(1,1,1);
		ЭтотОбъект.ТелефонКурьера  = "";
		ЭтотОбъект.ФИОВодителя = "";
	КонецПроцедуры
	
	#КонецОбласти 
	
#КонецЕсли
